app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "commenter", "created_at") VALUES('2009-04-14 02:04:47', 'this is my comment for this post', 1, 'lauren hodgson', '2009-04-14 02:04:47')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save