app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('post1', '2009-04-13 22:06:50', 'this is a post title', 'here is all my post content', '2009-04-13 22:06:50')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "content" = 'sdfwrwe', "updated_at" = '2009-04-13 22:12:37' WHERE "id" = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])